{"meta":{"title":"Headless CMS; A Brief Introduction","description":"<p>What <em>is</em> a Headless CMS, and how can it be useful for building websites and apps?</p>\n","date":"2021.05.28","slug":"headless-cms-introduction","collection":"texts","timestamp":1622185200000},"content":"<p>A Content Management System is a central aspect of any web project - even projects where you would never think of as &quot;having&quot; or &quot;using&quot; a CMS. In these sorts of projects the content management system <em>is</em> the codebase, and the strategy for managing content is identical to the process for managing code. This, obviously, is not ideal for anyone who wants to edit content and not code, or in uncomfortable in the workflows that developers rely on for our day-to-day practice — like Git. The other end of the spectrum of CMS is something like Squarespace — the code is the content. Not ideal if you want to edit code and not content. A traditional CMS like Wordpress attempts to split the difference; the CMS controls the code and the content, but makes an attempt to keep them at least a little independant by storage content in a database and providing an admin interface for editing and authoring that content.</p>\n<p>All of the above approach the problem of content management with the same set of assumptions: the CMS is responsible for taking the content, combining it with the code, and assembling and delivering the entire website. Both parts are coupled together, with the CMS rendering the &quot;head&quot; of the website or app.</p>\n<p>In the past few years with rise of build-time generated and static sites, a new approach to this problem has been articulated and built by a number of companies. The basic idea underlying this new approach is that the CMS should only be in charge of content, and interacted with like any other API. This decouples the code from the content, and removes the CMS from any responsibility of interacting with the code at all. This style of CMS does not render anything out to the web, and is thus called a headless CMS. In short, a headless CMS has no website out of the box. This means there is not a default theme (there are no themes!) to configure, there is no classic &quot;blog&quot; visuals or interfaces to configure and map too content. A blog is just one of many things a headless CMS can be used for.</p>\n<p>A headless CMS has a number of advantages: the first among them is that the product in charge of managing content can focus solely on managing content, and be very, very good at authoring, creating, and editing without needing to also be a good tool for building web apps with. The second biggest advantage is it provides the development team with complete freedom to meet the real-world business use cases associated with the project without relying on the CMS to support those use cases.</p>\n<p>Search Engine Optimization is an excellent example of these two characteristics at work – we are completely free to implement any SEO improvements without any support from the CMS, because the CMS doesn't do anything but manage content. SEO tags and page metadata can become content like any other content, and the codebase of the web app is responsible for rendering the actual website as it goes over the wire and gets consumed by browsers. Instead of relying on Wordpress Plugins or trusting that Squarespace is following best practices, all of the implementation details over your SEO strategy is completely in your teams control — just like any project <em>without</em> a CMS integration — while the content itself is entirely in your strategy or marketing teams control.</p>\n<p>A Headless CMS exposes content via an API, and that's all it does.</p>\n<p>Contentful provides a set of client libraries that allow content to be consumed in a developers language of choice, meaning that the technologies or systems used to render your app can be selected by any set of criteria at hand, rather than being forced into a decision by the CMS – if you use Wordpress you're writing your app in PHP within Wordpress. With Contentful you can <a href=\"https://github.com/contentful-labs/contentful-go\">write your app in go</a> if you want and live your best life.</p>\n<p>Below is a quick overview of using the Contentful JavaScript SDK to access content in the Headless CMS. It returns JSON and can be used at run-time or build-time to add content to a website or app:</p>\n<pre><code><span class=\"hljs-keyword\">const</span> contentful = require(&#x27;contentful&#x27;)\n\n<span class=\"hljs-keyword\">const</span> client = contentful.createClient({\n  space: <span class=\"hljs-variable\">&lt;space-id&gt;</span>,\n  accessToken: <span class=\"hljs-variable\">&lt;access-token&gt;</span>,\n  host: <span class=\"hljs-variable\">&lt;host&gt;</span>\n})\n</code></pre>\n<p>The <code>client</code> provides a set of methods for interacting and querying the content database;</p>\n<pre><code> getSpace: <span class=\"hljs-keyword\">async</span> ƒ getSpace(),\n  getContentType: <span class=\"hljs-keyword\">async</span> ƒ getContentType(),\n  getContentTypes: <span class=\"hljs-keyword\">async</span> ƒ getContentTypes(),\n  getEntry: <span class=\"hljs-keyword\">async</span> ƒ getEntry(),\n  getEntries: <span class=\"hljs-keyword\">async</span> ƒ getEntries(),\n  getAsset: <span class=\"hljs-keyword\">async</span> ƒ getAsset(),\n  getAssets: <span class=\"hljs-keyword\">async</span> ƒ getAssets(),\n  createAssetKey: <span class=\"hljs-keyword\">async</span> ƒ createAssetKey(),\n  getLocales: <span class=\"hljs-keyword\">async</span> ƒ getLocales(),\n  parseEntries: ƒ parseEntries(),\n  <span class=\"hljs-keyword\">sync</span>: <span class=\"hljs-keyword\">async</span> ƒ <span class=\"hljs-keyword\">sync</span>()\n</code></pre>\n<p>You can use the <code>getEntries</code> function to get all the entries available:</p>\n<pre><code>client<span class=\"hljs-selector-class\">.getEntries</span>()\n  <span class=\"hljs-selector-class\">.then</span>(entries =&gt; {\n    console<span class=\"hljs-selector-class\">.log</span>(entries)\n  })\n</code></pre>\n<p>Or query on metadata or content:</p>\n<pre><code>  client<span class=\"hljs-selector-class\">.getEntries</span>({\n    content_type: <span class=\"hljs-string\">&#x27;lesson&#x27;</span>,\n    <span class=\"hljs-string\">&#x27;fields.slug[in]&#x27;</span>: <span class=\"hljs-string\">&#x27;content-management&#x27;</span>\n  })<span class=\"hljs-selector-class\">.then</span>(entries =&gt; {\n    console<span class=\"hljs-selector-class\">.log</span>(entries)\n  })\n</code></pre>\n<p>Contentful in particular is interesting because one of the fields you can add to your entries is a reference <em>to other entries</em>. This gives the information architecture model some pretty amazing abilities to structure and enable pretty much any sort of content strategy you want to build. Some simple key-value pairs for getting strings to complicated, nested, conditional data structures.</p>\n<p>And from the code's perspective, it's all just JSON!</p>\n"}