{"data":{"fm":{"title":"Foucault's Pendulum","slug":"foucaults-pendulum","author":"Umberto Eco","year":1982,"source":"https://bookshop.org/books/foucault-s-pendulum-9780151327652/9780156032971","tags":"conspiracies, numerology","thesis":"The horror of meaninglessness leads us to seek a deeper meaning in pareidolic connections of arbitrary facts. Actively encouraging this tendency — even cynically and for profit — can lead to earnest commitment from your audience and end in tragedy.","type":"annotation, bibliography"},"code":"<p>Reading Foucault's Pendulum in 2021 was a deeply depressing experience.</p>\n<p>To speak directly to the current client of conspiracy theory and American politics, Eco deals <em>explicitly and directly</em> with emergent facism and proliferation of conspiracy theory. In 1982. And focuses on Christian nationalism. In 1982. And basically sketches out the situation that led to the crises that led to Jan. 6. In 1982.</p>\n<p>It's a great book — long and winding, with a compelling <em>in media res</em> that centers Eco's <em>probably unique</em> interest and understanding of Italian post-war facism and semiotics. While the primary story is told by the narrator Casaubon, most of the books told as other, tangentially related stories. Some of these are Casaubon's, a lot of these are another character Belbo's, and the rest are from a wide variety of strange and interesting characters they meet.</p>\n<p>As far as the plot goes, the story is about the Knights Templar and Gnostic mysticism. The fundamental premise of the novel is that there are a lot of coincidences around historical stories that have really unsatisfying explanations, and in to this void step the gnostics, who are sure that there is something that can be known that will explain everything. And by everything, we get to explanations of <em>everything</em>. Our protagonists Casaubon, Belbo, and Diatollevi, seek to create the grand unified theory of everything. They build on gnostic traditions and methods to explain a cohesive story of the unexplained. They call is &quot;The Plan&quot;. Initially they do it from a sense of cynical parody, then from an attempt to extract money from their marks, and ultimately they fall victim to the appeal of the pareidolic connection, and convince themselves that this is a natural way of interpreting history. This has immense consequences for all three of them.</p>\n<p>There is a lot I'm not touching on here — from the role that the women in the novel play (problematic at best, especially with Lorenza, and I'm not too sure about Eco's treatment of Lia, the novels most level-headed character) to specific Christian theological histories (honestly I just don't give a shit). But the core of the book is worth considering in relation to our current time and place.</p>\n"}}