{"data":{"fm":{"title":"Is Progressive Enhancement Dead Yet?","slug":"is-progressive-enhancement-dead-yet","author":"Heydon Pickering","year":2021,"source":"https://briefs.video/videos/is-progressive-enhancement-dead-yet/","tags":"design, development, javascript, js","thesis":"Progressively enhancing web applications is not only an essential practice for accessibility, but it provides a framework to respect separation of concerns in technology _and_ reduce boilerplate, polyfills, and otherwise kludgy code.","type":"annotation, bibliography","timestamp":null},"code":"<p>Pickering wants to talk about Progressive Enhancement, but apparently a lot of people are over it and want to be done with it. Pickering thinks that putting progressive enhancement to bed – and worrying about it no more would be a &quot;grave&quot; mistake.</p>\n<p>Pickering addresses some common misconceptions.</p>\n<p>Progressive Enhancement is Not:</p>\n<ul>\n<li>Something you install using a package manager.</li>\n<li>Progressive enhancement is not a <code>&lt;noscript&gt;</code> tag with the text &quot;Please turn on Javascript&quot;.</li>\n<li>Progressive enhancement is not rendering HTML on the server, then having the browser re-render that HTML via hydration (<em>React</em>)</li>\n</ul>\n<p>Pickering uses an metaphor of the skateboard to explain what progressive enhancement <em>is</em>.</p>\n<blockquote>\n<p>Imagine two skateboards. One is the old fashioned kind, it's just a board with wheels. The other has a screw hole near the front, allowing you to attach some handlebars and make the skateboard a scooter. Just because the handlebars don't attach to the older skateboard doesn't mean it's broken. It still works as a skateboard.</p>\n</blockquote>\n<p>In Pickerings example, the handlebars are a feature that the browser may or may not support. Importantly, if there is no support for the feature, things <em>still work fine.</em> Great emphasis is placed on this point.</p>\n<blockquote>\n<p>The basic layout is not a broken layout.</p>\n</blockquote>\n<p>Here's a provide example of a progressively enhanced masonry layout:</p>\n<pre><code>.grid {\n\tdisplay: grid;\n\tgrid-template-columns: repeat(4, 1fr);\n}\n\n@supports (grid-template-rows: masonry) {\n\t.grid {\n\t\t.grid-template-rows: masonry;\n\t}\n}\n</code></pre>\n<p>If a browser supports <code>@supports</code> and <code>grid-template-rows:masonry</code>, the layout engine applied the layout. The key here is that out layout tools are handling out layout, and Javascript is not relied on <em>at all</em> for functions that Javascript is not intended for.</p>\n<p>Another example, using <a href=\"https://github.com/Heydon/watched-box\"><watched-box></a> is provided:</p>\n<pre><code>// use web component\n&lt;watched-box\n\twidthBreaks=&quot;320px, 60ch&quot;\n\theightBreaks=&quot;100vh, 2014px&quot; \n/&gt;\n\t&lt;!-- children --&gt;\n&lt;/watched-box&gt;\n\n// progressive enhancement logic \nif ('ResizeObserver' in window &amp;&amp; 'customElements' in window) {\n\tcustomElemeents.define('watched-box', WatchedBox);\n}\t\n\n// load custom element as module\n&lt;script type=&quot;module&quot; src=&quot;watched-box.js&quot;&gt;&lt;/script\n</code></pre>\n<p>The module import self-selects for modern browsers, the custom element code itself checks for browser feature support, and if none of these things exist the children of the <code>&lt;watched-box&gt;</code> tag render normally.</p>\n<p>Another example of conditionally importing Javascript:</p>\n<pre><code>// ignored by old browsers, used by modern browsers\n&lt;script type=&quot;module&quot; serc=&quot;new.js&quot;&gt;&lt;/script&gt;\n\n\n// ignored by modern browsers, used by old browsers\n&lt;script nomodule src=&quot;old.js&quot;&gt;&lt;/script&gt;\n</code></pre>\n<p>This is all predicated on respecting the separation of concerns for HTML, CSS, and JS, and it's important that we don't do thing in JS that could and should be done with CSS.</p>\n<p>Pickering closes with a counter-example of regressive enhancement with a tab pattern. This pattern is better handled in a traditional HTML structure, as adding large amount of Javascript to collapse the pattern into tabs create both an accessibility and user experience nightmare that can be hugely difficult to untangle. Pickering identified the important of letting the browser technologies do their thing.</p>\n<p>The final note is as follows:</p>\n<blockquote>\n<p>Use Javascript to do Javascript things. And not Javascript to do like … not Javascript things.</p>\n</blockquote>\n"}}