{"data":{"fm":{"title":"Lost In Math","slug":"lost-in-math","author":"Sabine Hossenfelder","year":2018,"source":"https://bookshop.org/books/lost-in-math-how-beauty-leads-physics-astray/9781541646766","tags":"physics, math, aesthetics, design","thesis":"In theoretical physics, the proliferation of theory outstrips the pace of experiment, leading to a situation where theories must be assessed by criteria other than their relationship to the real world. The current criteria are aesthetic ones, and that has led to 30 years of stagnation.","type":"annotation, bibliography"},"code":"<p>Hossenfelder has written an outstanding book — not only has she provided an accessible pop-sci introduction to <em>all of physics</em> but she also has included a sharp and insightful critique of the <em>theory of theoretical physics</em>. What's more, the whole things is written with an air of approachability and dry cutting wit. The book is makes me want to loan it to everyone I know and stop writing, since I'll never be able to write as well, as insightfully, or as entertainingly as Hossenfelder. Anyway, on to the content!</p>\n<p>Hossenfelder covers a <em>lot</em> of ground in this slim novel, and all of it is interesting. For this annotation however, I'm going to focus on her argumentation around aesthetic influence over hard science, my take on the root causes of the problems she identifies, and Appendix C — &quot;What You Can Do To Help&quot; — which I found surprisingly relevant to issues in &quot;The Industry&quot; of web development.</p>\n<p>Let's start with Aesthetics. Coming as I do from a fine arts background, and working now in a &quot;technical&quot; field, there's an interesting tension at work with aesthetics. Perhaps counter-intuitively, the arts have long <em>rejected</em> aesthetic criteria for determining value — and contemporary artists like <a href=\"http://morganrosskopf.com/\">Morgan Rosskopf</a> are working to reclaim it's importance in the field — while Hossenfelder posits that aesthetics are <em>too dominant</em> as criteria in theoretical physics. Why this is the case is an interesting question, but it's worth noting that they mean the same thing when they use the word: beauty for the sake of being beautiful. (As a counter to this, I had a funny moment when Hossenfelder referred to phenomenologists of physics, and when I flipped <em>immediately</em> to the footnote on this term she had written &quot;not that kind of phenomenologist.) Hossenfelder's primary argument is that aesthetic concerns are primarily <em>anthropocentric</em> concerns, and when exploring the most fundamental questions of &quot;what the fuck, why?&quot;, reality has little regard for the anthropocentric. She cites numerous examples where the best answers to the question of &quot;why&quot; are deeply anti-human — that is, they are repugnant to even the scientists who propose them. We don't like the way the universe works, and the universe doesn't give a <em>shit</em>. It is what it is. While the physics is fun and the interviews are great, where this story gets <em>really</em> interesting is in a sort of applied Bruno Latour &quot;facts are socially constructed&quot; sort of way, which brings me to my next interest in the book.</p>\n<p>Hossenfelder makes a compelling case that while <em>the fundamental principles of the universe</em> don't give a shit about anthropocentric aesthetics, editorial boards of publications and  people who control grant money sure do. It's like Keats' old &quot;  &quot;Beauty is truth, truth beauty, — that is all Ye know on earth, ye and all ye need to know.&quot; But swap &quot;truth&quot; for &quot;funding&quot;. Here, Hossenfelder uses her argument <em>against</em> aesthetics as criteria for determining value as a proxy for economic and political systemic pressures corrupting the scientific process. If continued funding relies on a predetermined result (and that result is predetermined based on aesthetic criteria) a researcher finding that result should be viewed with suspicion rather than celebration. This is not the case currently. My take-away is less that the problem Hossenfelder identifies within the community of theoretical physics is an over-reliance on aesthetic criteria (the primary hook of the book) and more that the social structure of contemporary life under late-stage capitalism is inherently antithetical to meaningful, substantive research. Hossenfelder cites growing economic inequity and insecurity as prime forces in the creation of the current climate of human-centered motivations for research directions. It's easy to come to conclusions that your boss likes when your paycheck is on the line.</p>\n<p>Particularly striking was Hossenfelders Appendix C, &quot;What You Can Do To Help&quot;. &quot;Help&quot; in this case refers to &quot;help mitigate the dominance of anthropocentric biases in research of fundamentally human-agnostic areas&quot;. Hossenfelder organizes this section into three parts, one for the performer of researcher, one for the funder or validator of research, and one of the consumer or observer of research. For the performer of research, Hossenfelders advice is fundamentally about understanding and counteracting <em>social systems</em> and <em>cognitive biases</em>. She elevates the concept of criticism and centers an individual's power against organizational issues in the power to say &quot;No&quot;. For the funder or validator of research, Hossenfelders advice is about creating barriers between the researcher and the ravages of capitalism. She praises tenure, proposes defenses against the constant hustle, supports graceful  abandonment of previous work, and — most importantly — makes clear that &quot;learning new things&quot; and &quot;making money&quot; may not have any meaningful overlap <em>at all</em>. Hossenfelders advice to the rest of us is that we need to be aware and cognizant of social and economic pressures on scientists — especially particular popular pop-sci writers and personalities — and what that implies about the theory they're peddling. We all know that Koch-founded climate scientists are not to be trusted, but is the 2-year-contract post-doc struggling to make rent any more reliable? Our current system incentivizes pleasing rich individuals and organizations in order to escape the nightmare of economic precarity. Academics with massive outstanding student debt are not less immune to this than the rest of us.</p>\n<p>In this Appendix C I saw the most overlap with my own industry — web development and the creation of the internet. It's too easy for us to pretend that we serve this higher purpose, this call to meet the needs of humans and <em>solve hard problems</em>. The reality is that we are just as susceptible to the social and cognitive biases as anyone else, and our motivations are consistently undermined and conflicted by our need to stay employable and fundable. There's no such thing as tenure in a start up — unless you're the founder. Then it's a game of funding. Same problems, same results. How else do we explain the popularity of CSS-in-JS?</p>\n<p>At the end of the day, Hossenfelder makes an unusual and compelling argument for what the leftists among us already know — we need to create new systems for determining value and supporting productive human endeavor, because capitalism is  leading us down a dead-end which will kill us all.</p>\n"}}