{"data":{"fm":{"title":"Map as Context","slug":"map-as-context","date":"2015.2.19","description":"Understanding maps as designed objects and attempting to define a theory for making digital maps on the internet as good as old paper maps.","type":"text, texts"},"code":"<p>Looking at maps as they exist today on the internet, we have a pretty solid idea of what that means. It means they look like Google Maps. This is a pretty recent design solution to the 'what is a map on the internet' problem, only about 10 years old. Which is old for internet, but pretty young for maps. The Google Maps model is a good one, too! It's a very effective way to present what is essentially a road map - a drivers atlas for navigating a city or a country. Google Maps replaces the AAA State Highway map really effectively, but perhaps there are some weak links with how it applies to other, less navigation-oriented maps.</p>\n<p><img src=\"01-amt2_akershus-amt-57-vi_1887.jpg\" alt=\"\" /></p>\n<p>There a large number of really beautiful maps that exist only on paper, and a large number of really ugly maps that exist on screens. How can we start to think about maps in a way that bridges this gap? Is there a way we can approach these other, not-a-roadmap-map maps more effectively to make them as good as their paper-bound cousins?</p>\n<p>To approach this question from an angle, it's worth taking a moment to think about what a map <em>is</em>. The map is a miniature that pivots around the body to represent the gigantic enormity of the physical world. The map shrinks the world down to a place it can be held in the hands and entirely seen with the eye. The map connects the vastness of reality to the body in way that can be handled - both physically and mentally.</p>\n<p>This creates tension with maps on the screen - especially the internet. The screen can <em>not</em> be touched, and the internet can not be related to the body. Phones and tablets mitigate this by bringing the screen closer, and moving to the size of the hand, but the core difficulty remains – if a map exists to scale down the enormity of the world to the size of the body, the internet itself has no boundaries or edges, and way to relate the screen to the body.</p>\n<p>Why is this connection between world and body important? The map provides context for understanding world-scale systems and landscape-scale concepts in a human-scale object. The map is a typology of communication that sits half way between the book and the visual art object. Both the book and the painting – or the print – are techniques that are used to provide access to concepts and ideas beyond the scale of a single individual. The book can contain centuries of intellectual thought, the painting can expose feelings and emotions that touch any number of people. If the map exists between these two mode of communication, that means that it's goal is to use a volume of thought, of data, of measurements to expose a broad, underlying concept. This can be an environmental truth (or the supposition of one) or a societal insight.</p>\n<p>The map does this through a very specific set of visual design tools with formal qualities that lend themselves to the problem at hand. These formalities are partly defined and structured by the technologies behind the production and distribution of the map.</p>\n<p>The first maps where hand drawn, and correspondingly have attributes of other hand-made visual works. With the advent of printing, maps started to be carved into wood, and duplicated. After wood, they came to etching, and after that lithography. In each of the print techniques, certain marks are favored and made possible through the medium of the matrix itself. Shared in all the print techniques, however, is the concept of plates – individual drawn layers for different colors. Equating individual plates to individual colors to individual <em>typological concepts</em> being shown on the map is a big reason why printed maps are so good.</p>\n<p>The careful and deliberate application of the maps formal characteristics to directly address the ideas and concepts to be communicated, the address the <em>use</em> of the map is what makes a map good.</p>\n<p>On the internet, we make maps differently. GIS data sets mean that maps can be made through mathematical and analytic tools – comparing sets of data, and creating new sets of data to answer questions. A robust and open set of public data means that there are map making tools which provide ways to style and combine existing content.</p>\n<p>These techniques utilize a relatively static map that purports to usefully describe the entire geography of the planet. All of the maps made are intended to sit within larger application, itself designed to solve a problem.</p>\n<p>Most of the time, these maps fail to provide meaningful connection to the concepts provided - they lose the essential aspect of the map that join world-to-human scales, instead operating at the world-to-world level. The endless map of the internet is itself incomprehensible to the body. The maps of the internet are simultaneously too broad and too simple, providing too much and too little. The problem the map is presenting itself as a solution too is usually far too muddy, and the resulting lack of clarity of purpose leads to a map with itself a lack of clarity.</p>\n<p>Looking to the main purpose of the map — simplicity, clarity, and the miniaturization of the world to pivot around the human hand — while using the formal visual tools and design lessons of the previous several centuries of paper maps – the balance of simplification and exaggeration, clear conceptual separations, and embracing the limitations of the object to provide focus.</p>\n<p>In all, the map must be appropriate and natural for it's intended use, playing its role in the overall purpose of the design solution.</p>\n"}}