{"data":{"fm":{"title":"What do we lose when it's easy to use?","slug":"medium-design","author":"Andy Pressman","year":2016,"source":"https://designportland.org/stories/2016/what-do-we-lose-when-its-easy-to-use","tags":"design","thesis":"The intentional creation of friction in an experience is an essential way to create experience and communicate values.","type":"annotation, bibliography","timestamp":null},"code":"<p>Pressman runs a local design studio called Rumors. In 2015 they launched a new site that got a lot of critique on Designer News about its 'usability'. Pressman created an experience when preview thumbnails exist behind the text and flee from the cursor.</p>\n<blockquote>\n<p>I hate the word usability. I hate that it's squishy, poorly defined … all I can come to is &quot;ease of use&quot;. Is the interface easy to use or easy to understand?</p>\n</blockquote>\n<p>Pressman wonders who the implied &quot;for whom&quot; is in the statement.</p>\n<blockquote>\n<p>All these sites where all being built on the same framework and had the same look and feel.</p>\n</blockquote>\n<p>Pressman explores 'period styles.' He examines that web design has clear period styles which are tightly coupled to technological developments. Early web was focused on tables, due to the current tech. Then Bootstrap.css became a thing, and it moved quickly into its own period style. Bootstrap as a framework caused a development of a signature product style.</p>\n<blockquote>\n<p>The more familiar the interface the less cognitive load … users grow accustomed to a set of behaviors … and take the desired action.</p>\n</blockquote>\n<blockquote>\n<p>Did the user do the thing?</p>\n</blockquote>\n<p>Pressman explores how the focus on conversions became the defining impulse to design decisions.</p>\n<blockquote>\n<p>Homogeneity reduces friction.</p>\n</blockquote>\n<p>Friction, and the desire to remove friction for the sake of conversions, drove a uniformity of a period style.</p>\n<p>Pressman offers an example from Speikermann who thinks the web should be alike a book – which is a classic Speikermann take.</p>\n<p>Pressman instead says that the web is a &quot;medium that we inhabit&quot; – and avoiding any friction &quot;reduces the medium to a series of consumer efficiencies.&quot; This reduction has strong similarities to the reduction of our current age – the deletion and removal of anything that doesn't immediately and efficiently serve the needs of capital.</p>\n<blockquote>\n<p>The web is full of terrible, frustrating experiences … ease of use can and should be empowering.</p>\n</blockquote>\n<p>There are some places – and functions of society – where ease of use is a powerful tool that <em>should</em> be prioritized.</p>\n<p>However, &quot;frictions and inefficiencies are the moments that slow us down&quot;. This means that <em>intentionally</em> creating friction, erecting a barrier to slow down the user before hitting the endpoint &quot;allows the user to process an experience rather than just consume it.&quot; Pressman quotes <a href=\"https://laurelschwulst.com/\">Laurel Schwulst</a> questions:</p>\n<blockquote>\n<p>Is it specific?\nIs it memorable?\nDoes it turn idea into form?</p>\n</blockquote>\n<p>Usability cannot be the <em>sole</em> criteria of of &quot;good&quot;, and these are a good starting place to expand our practice. Pressman adds a fourth:</p>\n<blockquote>\n<p>Does it benefit the user?</p>\n</blockquote>\n<p>Pressman notes that none of these preclude ease of use, but they do focus on experience rather than outcome. Pressman suggests that https://www.mcmaster.com/ is the very best website on the internet. I agree! This is an amazing site.</p>\n<blockquote>\n<p>This response to the literacy of its users is what allows the site to be usable.</p>\n</blockquote>\n<p>Pressman talk about the use style, which at its core is a vernacular language that allows you to efficiently speak to others that understand the same vernacular. This culls, rather than grows, an audience. Style performs the same function as jargon here, and acts as a way to attune a signal to a receiver. A reduction of the broadcast to the narrow-band communication.</p>\n<blockquote>\n<p>Brands depend on mental models of value.</p>\n</blockquote>\n<p>Pressman talks about how the process of learning to use a difficult thing creates a sense of ownership. Pressman sees the value in creating and rewarding experience.</p>\n<p>Pressman gives the example of Printed Matter, and calls out that the deliberate introduction of friction can communicate a significant amount of <em>value</em> and <em>intention</em>. By creating friction in a certain way, by deliberately moving away from the frictionless standard, it invites the question of &quot;why did we do this?&quot;. If that question can be answered from a place of meaning, your values are communicated to the audience, and you can filter down a generic audience to a specific one that shares those values.</p>\n<blockquote>\n<p>Meaning and form aren't just seen. Form is the behavior.</p>\n</blockquote>\n<p>This relates back to the fundamental stuff-ness of the web.</p>\n<p>The fourth point about benefit is about ethics – and creating a baseline ethical behavior for the interactions. This is the basic opening of web developments ethical compass: does it do what the user wants to do?</p>\n<blockquote>\n<p>A dark pattern is frictionless design taken to its logical conclusion.</p>\n</blockquote>\n<p>An example of how the shifting rubrics and definitions of &quot;good&quot; are fundamental to the execution and creation of any designed work. MetaFilter is a powerful example of creating a lot of friction <em>against</em> rapid growth. This creates a benefit for the broader community. Against twitter, it's clear where values lie and the ethical ramifications of sets of decisions.</p>\n<blockquote>\n<p>The Frustration Threshold: How much friction can we add before it becomes frustration?</p>\n</blockquote>\n<p>This is directly correlated to the specificity of the users goals. When looking for a phone number or address, the threshold is very very low. It's also correlated to the scale of the audience, which maps back to the use of values as a filtering mechanism.</p>\n<blockquote>\n<p>The more you understand of [the users needs] the more difficult and complex an experience you can build</p>\n</blockquote>\n<p>Pressman ends the talk by framing the central question that he wants us to consider: Instead of &quot;How can I make everything easy to use?&quot; ask &quot;Just what components can be difficult?&quot;.</p>\n"}}hands on the faders and toggles of organization.</p>\n</blockquote>\n<p>This is deeply related to the thesis I outlined in <a href=\"/texts/how-to-design-while-developing\">How to Design While Developing</a>.</p>\n<blockquote>\n<p>It is the design of interdependencies, chemistries, chain reactions. It benefits from an artistic curiosity about spatial wiring or reagents in spatial mixtures. You are designing not only a single object but a platform for inflecting populations of objects or setting up relative potentials within them. You are comfortable with dynamic markers and unfinished processes.</p>\n</blockquote>\n<p>This is perhaps the single best definition of web design I have very seen.</p>\n<blockquote>\n<p>And maybe the existence or content of a problem is less important than the interplay between problems. Failure is a limitless wilderness for design ecologies.</p>\n</blockquote>\n<p>Welcome to … the Internet. This is exactly how we generate successful work in the medium of the internet.</p>\n<blockquote>\n<p>If an unsafe factory collapses or burns, there is an event to mark the violence, but in countless factories or industrial parks that do not buckle under the weight of their own denial, there is no event, no drawn sword. There is only latent temperament—the constant aggression of blatantly imbalanced power dynamics. The potential for either concentrating or distributing power; the potential for escalating or reducing violence.</p>\n</blockquote>\n<p>Easterling here defines the struggle with the modern web. Is there a connection here to what it would mean to practice an ethical web design? Not to have answers or solutions, but to navigate the tangled web of semantics in ways that reduce the potential for violence, that ratchet slowly towards an ethical stance</p>\n<blockquote>\n<p>But if it has any hope of effecting change, it manipulates the organization as well as the instrumental narrative that attends it with moves that are potentially sneakier or more politically agile.</p>\n</blockquote>\n<p>A key takeaway here is that in order to produce effective work <em>in the world</em> part of the work needs to be done <em>to the organization</em>. Changing the organization and structure around the work is the only way to produce work that is different or more effective.</p>\n"}}