{"data":{"fm":{"title":"prefers-reduced-motion; Taking a no-motion-first approach to animations","slug":"prefers-reduced-motion","source":"https://tatianamac.com/posts/prefers-reduced-motion/","author":"Tatiana Mac","year":2021,"tags":"internet, design, a11y, accessibility, css, development","thesis":"Use the prefers-reduced-motion media query to help guide your animation principles. By default, do not include animations, which should only be approached as a progressive enhancement.","type":"annotation, bibliography"},"code":"<p>While animations can be quite powerful tools for communication relationships and building a brand, Mac notes that &quot;Animations, especially when overused and abused, can make people very ill.&quot;</p>\n<p>Mac notes that in their practice, the guiding approach is to default to the users explicit preferences:</p>\n<blockquote>\n<p>A core accessibility approach of mine is to let the user determine what's best for them and to enable as many user settings as I can. Most operating systems allow us to reduce the motion and have for a very long time.</p>\n</blockquote>\n<p>It's hard to find argument with this. This is clearly a good principle. This article will focus on <code>prefers-reduced-motion</code>, but its worth taking a note here that there are others which should be explored and expanded on, perhaps a project for another day.</p>\n<p>Mac leads with the two values for <code>prefers-reduced-motion</code> : <code>no-prefernce</code> and <code>reduced</code>. Importantly, Mac notes:</p>\n<blockquote>\n<p>I want to make a critical note here that this is operating on a no-consent model. Ew. The user hasn't necessarily opted into animations. They just haven't checked &quot;Reduce motion.&quot; That could be because they like and can tolerate animations, or, it's equally possible the user doesn't know about this setting. So, I want us to make sure we're not assuming that these users necessarily want animations.</p>\n</blockquote>\n<p>Mac cuts through what could easily be bad assumptions at the beginning of a project. Thinking carefully about what our starting assumptions — our front end axioms if you will — <em>actually are and are not</em> is of critical importance.</p>\n<blockquote>\n<p>Start with No Motion … When I collaborate with a designer/animator on an animation, I first ask, &quot;Is this animation critical to understanding the content?&quot; … More often than not, the answer is &quot;no.&quot; … When conceived well, animations should be an enhancement to an explanation.</p>\n</blockquote>\n<p>Mac will then default to <code>animation: none</code>, removing all animation entirely. Therefor, following the <code>first</code> methodology, we only <em>add</em> animation if the user settings are explicit about <code>no-preference</code>. Mac notes that the <code>first</code> methodology means that for older browsers without support for the media query, we default to the <em>more accessible</em> option. This is related to <a href=\"/bibliography/pickering/is-progressive-enhancement-dead-yet\">Pickering's explanation of Progressive Enhancement.</a>.</p>\n<p>Mac than notes that we can remove <em>all</em> the animations from the base style sheet bundle, and only serve them <em>if the user has <code>no-preference</code> set</em></p>\n<pre><code>&lt;link\n  rel=&quot;stylesheet&quot;\n  href=&quot;animations.css&quot;\n  media=&quot;(prefers-reduced-motion: no-preference)&quot;\n/&gt;\n</code></pre>\n<p>This is rather clever, because it creates an argument from performance for following a principle for accessibility.</p>\n<p>Mac then fleshes out a scenario where the designer has determined that the animation is in fact <em>critical</em> to the interaction. My favorite question to ask in this case (and Mac's &quot;spiciest&quot; is their direct and to the point &quot;If the animation can't load for someone or they can't see it, what was your plan?&quot;.</p>\n<p>Mac than moves to exploring other, non-css based animations:</p>\n<ul>\n<li>Auto-playing video: Don't do it. Just, don't do it.</li>\n<li>JavaScript animations: find a way to respect the setting, those tools are there. My take: don't do it.</li>\n</ul>\n<p>Mac ends the article with their own references.</p>\n<p>I particularly like and am compelled by Mac's argument that &quot;by default we should do the most accessible thing&quot; which is very close to my own principle of &quot;do as little as possible&quot; or &quot;keep it stupid simple&quot;, as well as Mac's commitment to knowing what the user settings are and respecting <em>all of them</em>. I for one have more to learn in this regard.</p>\n"}}