{"data":{"fm":{"title":"There Really Is No Ethical Restaurant Under Capitalism","slug":"there-really-is-no-ethical-restaurant-under-capitalism","source":"https://www.eater.com/21398969/future-co-op-worker-owned-restaurants-ethical-business","author":"Jaya Saxena","year":2020,"tags":"food, ethics, work","thesis":"Building an equitable restaurant — where all workers are paid fairly, have benefits, and work without discrimination — will require undoing the way most restaurants are run","date":"2020.09.01","type":"annotation, bibliography"},"code":"<blockquote>\n<p>TheThe only ethical restaurant I have ever heard of is on Star Trek: Deep Space Nine</p>\n</blockquote>\n<p>Saxena is is immediately concerned with the entire process of restaurant, and identifies that she's never even heard of a restaurant coming close to ethical outside of utopian fiction.</p>\n<blockquote>\n<p>Building an equitable restaurant, a place where all workers are paid fairly, have benefits, and can work in an anti-discriminatory environment, is going to take a near-undoing of the way most restaurants are run.</p>\n</blockquote>\n<p>This applies to companies and agencies that make the internet function as well.</p>\n<blockquote>\n<p>Living in a country that provided universal health care, federally mandated paid child leave and sick leave, and a living minimum wage, as well as incentivized sustainable farming, encouraged unions, and got rid of at-will employment, would go a long way toward creating environments within restaurants (and all businesses) where workers had power over their own livelihood.</p>\n</blockquote>\n<p>Again, this applies to the basic functioning of how we build the internet. The structure <em>around</em> how we make what we make directly informs and is inextricable from what results and ethics of what we make.</p>\n<blockquote>\n<p>…but Vartan continued to bring it up with employees, and eventually worked with Project Equity, an organization that advocates for and consults with companies to pivot to employee-owned models, to become a worker cooperative.</p>\n</blockquote>\n<p>Employee-owned companies are a step in the right direction. However, places like Amazon give their options stock options that vest. This is a common model for start-ups (Github).</p>\n<blockquote>\n<p>A Slice of New York allows employees to become co-owners after they’ve spent at least a year at the company; as of now, about 45 percent of the employees are co-owners.</p>\n</blockquote>\n<p>However it sounds like having access to stocks and being a true ESOP like this Pizza Joint or Miller Paint is a different deal.</p>\n<blockquote>\n<p>The restaurant’s governance is what’s really affected: Every co-owner has an equal share of the business and a vote on a board. Board members all have an equal say in decisions about benefits, safety procedures, menu changes, and issues dealing with the general financial wellbeing of the company.</p>\n</blockquote>\n<p>This is a revolutionary idea for the tech industry. This is what ethical starts to look like.</p>\n<blockquote>\n<p>No matter how kindly run and community-focused a restaurant’s structure is, wages are often the sticking point. After all, it’s a job; getting paid is the goal. And as much as co-op or nonprofit structures help with the overall work culture, they do not solve the problem so many restaurants face: It costs money to pay people a living wage.</p>\n</blockquote>\n<blockquote>\n<p>The reality is, even though Charmington’s is paying as much as it can while ensuring it can stay afloat, workers could probably make more elsewhere.</p>\n</blockquote>\n<p>Does &quot;ethical&quot; need to be compromise in this way?</p>\n<blockquote>\n<p>… when it comes to restaurants, it’s hard to change one thing unless you’re changing everything.</p>\n</blockquote>\n<p>There are systemic forces at work that prevent any individual, or even any small community from truly reaching a place of ethical behavior. This makes me think that there has to be a split between &quot;acting ethically&quot; and &quot;being ethical&quot;. We can all act ethically, working our way upstream against the system forces arrayed against us, but that's no guarantee that we will, at the end of the day, be ethical.</p>\n<blockquote>\n<p>Of course, not every meal can realistically be $195 per person. The cost of providing every employee with a living wage and benefits — not to mention paying rent and insurance, and serving a good product affordable enough for most people — is nearly impossible with the way restaurants, co-op or not, must run.</p>\n</blockquote>\n<p>Why is this? We live in a time of unprecedented efficiency, unbelievable abundance, and massive wealth but if a <em>restaurant</em> is called to truly account for its exploitation to charge its true price, it's immediately untenable. This feels like it must be true across many industries – Uber would rather cease service in California than treat it's drivers like employees. What would it take to truly understand what the network of costs, values, debts, and the real price of things?</p>\n<blockquote>\n<p>The problem of “good” food being prohibitively expensive can’t be completely solved by restaurateurs turning those knobs. Depressed wages and inflation are problems for everyone, not just restaurant workers</p>\n</blockquote>\n<p>Are those really two issues at work? I get the sense that those are both symptoms of an underlying disconnection between labor &amp; resources and consumption.</p>\n<blockquote>\n<p>Now, “value” can include not just customer experience, but the knowledge that employee well-being is part of the plan.</p>\n</blockquote>\n<p>Is that a value add?? Are we now just selling ethical choices, and letting the concept of the market determine how we can work? Because than we're just playing the same game with the rich being able to &quot;choose&quot; ethical consumption methods and purchase the ability to do the right thing, which absolves them of responsibility to change the system and support systemic reform. I guess this is the classic reform vs revolution problem, and the source of revolutionaries attacking reformers for making a broken system more bearable instead of truly fixing it. Again tho – the system isn't broken but designed. Getting out of that polemic means identifying the design.</p>\n<blockquote>\n<p>But everything restaurants can do on their own is a few drops in a bucket compared to what government support in the form of things like universal health care, or real aid for small businesses, could achieve.</p>\n</blockquote>\n<p>Thats the dream that articulated by Star Trek – government entities who have the ability to make real change <em>do</em>.</p>\n<blockquote>\n<p>Sustained change will take a greater understanding of what “equity” means, and what it will require from both restaurants and customers. As bad as the pandemic has been, it has put us in a great position to do that sort of reevaluation, and reimagine a restaurant as a place where success doesn’t mean profit, but rather that the whole community, farm-to-table, is cared for. And to maybe even fight for a day when it won’t be the responsibility of restaurants to solve these problems at all</p>\n</blockquote>\n"}}