{"data":{"fm":{"title":"Web Brutalism, Seamfulness, and Notion","slug":"web-brutalism","author":"Brandon Dorn","year":2020,"source":"https://www.viget.com/articles/web-brutalism-seamfulness-and-notion/","tags":"design, brutalism, user experience","thesis":"The essence of Web Brutalism is a way of creating spaces for thought and expression on the web that reflect the nature of thought and the web.","type":"annotation, bibliography"},"code":"<blockquote>\n<p>The web is fundamental to modern life, but modern life is also weird and bizarre and our commitment to usability needn’t hinder the expression of that strangeness.</p>\n</blockquote>\n<p>Dorn is writing from the tension between the &quot;weird web&quot; where usability isn't the primary concern for creating interesting and compelling experiences, and the moral and legal ramifications of universal accessibility.</p>\n<blockquote>\n<p>Web Brutalism has become a catchall term for websites that flout the conventions of modern web design with a kind of droll, utilitarian nostalgia for the early web.</p>\n</blockquote>\n<p>Okay I guess. I wonder how much the original content of the term as design methodology actually remains.</p>\n<blockquote>\n<p>Navigation elements are either in your face or purposefully obscured. 3D art, italics, plain, neo grotesk fonts, monstrous hover states, jewel tones, thick dividing lines, harsh contrasts are some of the hallmarks. The trend is decidedly hip, and popular enough to show up in The New York Times articles and Bloomberg design conference sites. You know it when you see it.</p>\n</blockquote>\n<ul>\n<li>https://www.nytimes.com/interactive/2018/04/06/style/meghan-markle-prince-harry-royal-wedding.html</li>\n<li>https://www.youtube.com/watch?v=pJt_cKHcFuw</li>\n</ul>\n<p>I guess this is actually a little different from what I understand Web Butalism to be, but I get his point. We're talking here about a post-contemporary style of design that blends 90's nostalgic elements with high-design print aesthetics while operating in a space of screen-native fluidity. Right on.</p>\n<blockquote>\n<p>”The purists reference strongly to the architectural characteristics of Web Brutalism, such as the concept of ‘truth to materials’ and the use of the purest markup elements available. The UX minimalists, in contrast, see efficiency and performance as the main driver of Web Brutalism and even believe that the radical limitation of possibilities can boost conversions. The ‘anti-ists’ or artists see web design as an (still) undervalued form of art and don’t show much respect [to] the status quo and mostly get bad press.“</p>\n</blockquote>\n<ul>\n<li>Pascal Deville, https://brutalistwebsites.com/</li>\n</ul>\n<p>Reference: https://www.smashingmagazine.com/2020/01/split-personality-brutalist-web-development/</p>\n<blockquote>\n<p>Most of what’s labeled Web Brutalism is a normcore visual aesthetic — the web version of anti-art, a rejection of refinement and sophistication — rather than a meaningful digital analogue to architectural Brutalism.</p>\n</blockquote>\n<p>I ... don't think that's true? Web Brutalist are highly refined and sophisticated aesthetic approaches, its just that they revel in a the ironic (so I guess I agree with the &quot;norm core&quot; part).</p>\n<p>After a quick overview of the term <em>Brutalism</em> in it's original architecture context, Dorn identifies the tension at the heart of the style that will pivot to our discussion of the web:</p>\n<blockquote>\n<p>The debate asks the question, To what extent should an object reveal its structure and operation to the user?</p>\n</blockquote>\n<p>Reminds me of: https://designportland.org/stories/2016/what-do-we-lose-when-its-easy-to-use</p>\n<blockquote>\n<p>Proponents of seamfulness argue that revealing an object’s complexity and operation can aid usability.</p>\n</blockquote>\n<p>See Chalmers and Galani: https://dl.acm.org/doi/10.1145/1013115.1013149</p>\n<blockquote>\n<p>Seamlessness emphasizes concealment; seamfulness emphasizes transparency.</p>\n</blockquote>\n<p>Dorn identifies Web Brutalism as a rejection of the high-corporate, contextless slickness of Apple and Google, which I very much agree with.</p>\n<blockquote>\n<p>The anti-art aesthetic has become the face of Web Brutalism because it's fun and edgy and all the cool kids are doing it.</p>\n</blockquote>\n<p>This gives me concern tho, as I see &quot;anti-art&quot; as fundamentally anathema to the Web Brutalist ethos. Dorn follows with:</p>\n<blockquote>\n<p>… [the] purists, minimalists, and anti-ists are all asking, in their own way, what it means to make something on the web that is true to the web</p>\n</blockquote>\n<p>Which is the sort of question and practice that <em>artists</em> engage with.</p>\n<blockquote>\n<p>What is the true material of the web? … But taking it somewhere in-between, seeing the web as primarily an information medium, we can ask the question a little differently: what does it look like to design something that is true to the material of digital information?</p>\n</blockquote>\n<blockquote>\n<p>The structure of [Notion] reflects the structure of the web itself: digital content is purposefully formatted, like semantic HTML elements, and exists in a hierarchical structure (directories on the web, nested pages in Notion), yet can be linked and referenced to create a complex network of information.</p>\n</blockquote>\n<p>This is a great way to identify how to design in a way that is honest to the material of the web, and is I think so foundational and fundamental to good web design that it feels obvious when stated like this but is so often overlooked and one poorly.</p>\n<blockquote>\n<p>This is the essence and opportunity of Web Brutalism: more than a utilitarian aesthetic, it’s a way of creating spaces for thought and expression on the web that reflect the nature of thought and the web.</p>\n</blockquote>\n<p>Yessssssss. This is a great way of looking at what it means to operate with Web Brutalism as a design principle rather than an aesthetic movement.</p>\n"}}